---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.op_LessThanOrEqual(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
source: html/27f333c0-256b-229d-3de8-07c14c452050.htm
---
# Autodesk.Revit.DB.WorksetId.op_LessThanOrEqual Method

Determines whether one WorksetId is not greater than another WorksetId.

## Syntax (C#)
```csharp
public static bool operator <=(
	WorksetId WorksetId1,
	WorksetId WorksetId2
)
```

## Parameters
- **WorksetId1** (`Autodesk.Revit.DB.WorksetId`) - The first WorksetId.
- **WorksetId2** (`Autodesk.Revit.DB.WorksetId`) - The second WorksetId.

## Returns
True if the first WorksetId is not greater than the second WorksetId, otherwise, false.